{
  "asin": "B0DXC331LY",
  "title": "The Three Brothers (The Secret World of Maggie Grey Book Series 3)",
  "authors": ". Granger and Granger",
  "highlights": [
    {
      "text": "A special note to those readers: This was originally supposed to be a 7 book series based around Maggie and her world. In addition to spin offs I set myself up for in the previous book for the side characters. Please have patience and understand that everything doesn't have to happen in just 2 books when it comes to Maggie and I don't only have to focus on one storyline or character when it comes to a series. Especially when building characters up to fall in love or hate with, for future books to come. I haven't mastered the art of writing a major series with standalone content. I like to take my time world building, I like exploring new characters and ideas, and enjoy little quirks and details that may or may not matter in the end. If you don't like it…then move along Muggle-boos, and kindly find another writing style that better fits your reading needs. *Make sure you hashtag #maggiegrey or #drewcollins when you make your comments. I'm trying to get this algorithm going man.   A special note to my readers: Welcome back. Y'all are amazing, just get it, and let me be me! Ugh! Authors love it when they find readers that just get it and vibe. Always and forever holding these characters down! Can't wait to see some of you guys in July for this",
      "isNoteOnly": false,
      "location": {
        "url": "kindle://book?action=open&asin=B0DXC331LY&location=24",
        "value": 24
      },
      "note": null
    },
    {
      "text": "Drew Collins University…     Acacia   I gripped the steering wheel of the Accord as I peered out of my driver side window. The brick buildings in the distance had lights on in each square window, mimicking that of an old high school or prison, depending on how you look at it. The traditional dorms here at Society Hill University weren't nearly as impressive as its rival Drew Collins, but what we lacked in money and prestige, we made up for in other ways.   I ducked my head when I saw the row of lights scanning the campus. Security cautiously rolled through the yard in their car. I was the first to sneak out of my dorm and make it to the car waiting in the back but the others were…   \"Shit, shit,\" I hissed, unlocking the doors as I saw Tam tip toeing in her heels with her gold",
      "isNoteOnly": false,
      "location": {
        "url": "kindle://book?action=open&asin=B0DXC331LY&location=78",
        "value": 78
      },
      "note": null
    }
  ]
}